[Killed] BlockStatement
src/Money.js:2:41
 class Money {
-  constructor(majorAmount, minorAmount) {
-    this.majorAmount = majorAmount;
-    this.minorAmount = minorAmount;
-    // Stryker disable all
-    this.currency = "EUR";
-  }
+  constructor(majorAmount, minorAmount) {}
   // Stryker restore all
   toDecimal() {
killedBy: checkFor should need approval by supervisor if payment by initiator with limit less than amount
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/Money.js:9:15
     this.currency = "EUR";
   }
   // Stryker restore all
-  toDecimal() {
-    return this.majorAmount * 10 * 10 + this.minorAmount;
-  }
+  toDecimal() {}
   compareTo(other) {
     return this.toDecimal() - other.toDecimal();
killedBy: checkFor should need approval by supervisor if payment by initiator with limit less than amount
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Survived] ArithmeticOperator
src/Money.js:10:12
   }
   // Stryker restore all
   toDecimal() {
-    return this.majorAmount * 10 * 10 + this.minorAmount;
+    return this.majorAmount * 10 / 10 + this.minorAmount;
   }
   compareTo(other) {

[Survived] ArithmeticOperator
src/Money.js:10:12
   }
   // Stryker restore all
   toDecimal() {
-    return this.majorAmount * 10 * 10 + this.minorAmount;
+    return this.majorAmount / 10 * 10 + this.minorAmount;
   }
   compareTo(other) {

[Killed] BlockStatement
src/Money.js:12:20
   toDecimal() {
     return this.majorAmount * 10 * 10 + this.minorAmount;
   }
-  compareTo(other) {
-    return this.toDecimal() - other.toDecimal();
-  }
+  compareTo(other) {}
 }
 
killedBy: checkFor should need approval by supervisor if payment by initiator with limit less than amount
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ArithmeticOperator
src/Money.js:13:12
     return this.majorAmount * 10 * 10 + this.minorAmount;
   }
   compareTo(other) {
-    return this.toDecimal() - other.toDecimal();
+    return this.toDecimal() + other.toDecimal();
   }
 }
killedBy: checkFor should not need approval if payment by initiator with limit more than amount
statusReason: TypeError: Cannot read properties of undefined (reading 'limit')
