[Survived] BlockStatement
src/PaymentAuth.js:2:17
 class PaymentAuth {
-  constructor() {
-    this.approvalNeeded = false;
-    this.primaryApprover = null;
-  }
+  constructor() {}
 }
 

[Survived] BooleanLiteral
src/PaymentAuth.js:3:27
 class PaymentAuth {
   constructor() {
-    this.approvalNeeded = false;
+    this.approvalNeeded = true;
     this.primaryApprover = null;
   }
