[Killed] BlockStatement
src/User.js:2:40
 class User {
-  constructor(name, limit, supervisor) {
-    this.name = name;
-    this.limit = limit;
-    this.supervisor = supervisor;
-  }
+  constructor(name, limit, supervisor) {}
 }
 
killedBy: checkFor should not need approval if payment by initiator with limit more than amount
statusReason: TypeError: Cannot read properties of undefined (reading 'toDecimal')
