[Killed] BlockStatement
src/checkFor.js:3:48
 const PaymentAuth = require("./PaymentAuth");
 
-const primaryApprover = (initiator, amount) => {
-  let supervisor = initiator.supervisor;
-  let limit = supervisor.limit;
-  const maxIterations = 10; // preventing infinite loops
-  for (let i = 0; i < maxIterations; i++) {
-    if (amount.compareTo(limit) > 0) {
-      supervisor = supervisor.supervisor;
-      limit = supervisor.limit;
-    }
-  }
-  return supervisor;
-};
+const primaryApprover = (initiator, amount) => {};
 
 const checkFor = (payment) => {
killedBy: checkFor should need approval by supervisor if payment by initiator with limit less than amount
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Survived] EqualityOperator
src/checkFor.js:7:19
   let supervisor = initiator.supervisor;
   let limit = supervisor.limit;
   const maxIterations = 10; // preventing infinite loops
-  for (let i = 0; i < maxIterations; i++) {
+  for (let i = 0; i <= maxIterations; i++) {
     if (amount.compareTo(limit) > 0) {
       supervisor = supervisor.supervisor;

[Timeout] UpdateOperator
src/checkFor.js:7:38
   let supervisor = initiator.supervisor;
   let limit = supervisor.limit;
   const maxIterations = 10; // preventing infinite loops
-  for (let i = 0; i < maxIterations; i++) {
+  for (let i = 0; i < maxIterations; i--) {
     if (amount.compareTo(limit) > 0) {
       supervisor = supervisor.supervisor;

[Killed] ConditionalExpression
src/checkFor.js:8:9
   let limit = supervisor.limit;
   const maxIterations = 10; // preventing infinite loops
   for (let i = 0; i < maxIterations; i++) {
-    if (amount.compareTo(limit) > 0) {
+    if (true) {
       supervisor = supervisor.supervisor;
       limit = supervisor.limit;
killedBy: checkFor should need approval by supervisor if payment by initiator with limit less than amount
statusReason: TypeError: Cannot read properties of undefined (reading 'limit')

[Killed] EqualityOperator
src/checkFor.js:8:9
   let limit = supervisor.limit;
   const maxIterations = 10; // preventing infinite loops
   for (let i = 0; i < maxIterations; i++) {
-    if (amount.compareTo(limit) > 0) {
+    if (amount.compareTo(limit) <= 0) {
       supervisor = supervisor.supervisor;
       limit = supervisor.limit;
killedBy: checkFor should need approval by supervisor if payment by initiator with limit less than amount
statusReason: TypeError: Cannot read properties of undefined (reading 'limit')

[Killed] BlockStatement
src/checkFor.js:16:31
   return supervisor;
 };
 
-const checkFor = (payment) => {
-  const paymentAuth = new PaymentAuth();
-  const initiator = payment.initiator;
-  const amount = payment.amount;
-  const limit = initiator.limit;
-
-  if (amount.compareTo(limit) <= 0) {
-    paymentAuth.approvalNeeded = false;
-  }
-
-  if (amount.compareTo(limit) > 0) {
-    paymentAuth.approvalNeeded = true;
-    const approver = primaryApprover(initiator, amount);
-    paymentAuth.primaryApprover = approver;
-  }
-  return paymentAuth;
-};
+const checkFor = (payment) => {};
 
 module.exports = { checkFor, primaryApprover };
killedBy: checkFor should not need approval if payment by initiator with limit more than amount
statusReason: TypeError: Cannot read properties of undefined (reading 'approvalNeeded')

[Survived] ConditionalExpression
src/checkFor.js:22:7
   const amount = payment.amount;
   const limit = initiator.limit;
 
-  if (amount.compareTo(limit) <= 0) {
+  if (true) {
     paymentAuth.approvalNeeded = false;
   }

[Survived] EqualityOperator
src/checkFor.js:22:7
   const amount = payment.amount;
   const limit = initiator.limit;
 
-  if (amount.compareTo(limit) <= 0) {
+  if (amount.compareTo(limit) > 0) {
     paymentAuth.approvalNeeded = false;
   }

[Killed] BooleanLiteral
src/checkFor.js:23:34
   const limit = initiator.limit;
 
   if (amount.compareTo(limit) <= 0) {
-    paymentAuth.approvalNeeded = false;
+    paymentAuth.approvalNeeded = true;
   }
 
killedBy: checkFor should not need approval if payment by initiator with limit more than amount
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] ConditionalExpression
src/checkFor.js:26:7
     paymentAuth.approvalNeeded = false;
   }
 
-  if (amount.compareTo(limit) > 0) {
+  if (false) {
     paymentAuth.approvalNeeded = true;
     const approver = primaryApprover(initiator, amount);
killedBy: checkFor should need approval by supervisor if payment by initiator with limit less than amount
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/checkFor.js:26:36
     paymentAuth.approvalNeeded = false;
   }
 
-  if (amount.compareTo(limit) > 0) {
-    paymentAuth.approvalNeeded = true;
-    const approver = primaryApprover(initiator, amount);
-    paymentAuth.primaryApprover = approver;
-  }
+  if (amount.compareTo(limit) > 0) {}
   return paymentAuth;
 };
killedBy: checkFor should need approval by supervisor if payment by initiator with limit less than amount
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BooleanLiteral
src/checkFor.js:27:34
   }
 
   if (amount.compareTo(limit) > 0) {
-    paymentAuth.approvalNeeded = true;
+    paymentAuth.approvalNeeded = false;
     const approver = primaryApprover(initiator, amount);
     paymentAuth.primaryApprover = approver;
killedBy: checkFor should need approval by supervisor if payment by initiator with limit less than amount
statusReason: Error: expect(received).toBeTruthy()

Received: false
