[Killed] BlockStatement
src/checkFor.js:16:31
   return supervisor;
 };
 
-const checkFor = (payment) => {
-  const paymentAuth = new PaymentAuth();
-  const initiator = payment.initiator;
-  const amount = payment.amount;
-  const limit = initiator.limit;
-  if (amount.compareTo(limit) <= 0) {
-    paymentAuth.approvalNeeded = false;
-  }
-  if (amount.compareTo(limit) > 0) {
-    paymentAuth.approvalNeeded = true;
-    const approver = primaryApprover(initiator, amount);
-    paymentAuth.primaryApprover = approver;
-  }
-  return paymentAuth;
-};
+const checkFor = (payment) => {};
 
 module.exports = { checkFor, primaryApprover };
killedBy: checkFor should not need approval if payment by initiator with limit more than amount
statusReason: TypeError: Cannot read properties of undefined (reading 'approvalNeeded')

[Survived] EqualityOperator
src/checkFor.js:21:7
   const initiator = payment.initiator;
   const amount = payment.amount;
   const limit = initiator.limit;
-  if (amount.compareTo(limit) <= 0) {
+  if (amount.compareTo(limit) > 0) {
     paymentAuth.approvalNeeded = false;
   }

[Survived] ConditionalExpression
src/checkFor.js:21:7
   const initiator = payment.initiator;
   const amount = payment.amount;
   const limit = initiator.limit;
-  if (amount.compareTo(limit) <= 0) {
+  if (false) {
     paymentAuth.approvalNeeded = false;
   }

[Killed] ConditionalExpression
src/checkFor.js:24:7
   if (amount.compareTo(limit) <= 0) {
     paymentAuth.approvalNeeded = false;
   }
-  if (amount.compareTo(limit) > 0) {
+  if (false) {
     paymentAuth.approvalNeeded = true;
     const approver = primaryApprover(initiator, amount);
killedBy: checkFor should need approval by supervisor if payment by initiator with limit less than amount
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
src/checkFor.js:24:7
   if (amount.compareTo(limit) <= 0) {
     paymentAuth.approvalNeeded = false;
   }
-  if (amount.compareTo(limit) > 0) {
+  if (true) {
     paymentAuth.approvalNeeded = true;
     const approver = primaryApprover(initiator, amount);
killedBy: checkFor should not need approval if payment by initiator with limit more than amount
statusReason: TypeError: Cannot read properties of undefined (reading 'limit')
